//S1.1. Вывести на экран число  с точностью до сотых.
//----------------------------------------------------
/* Console.Clear();
double a = 2.23;
System.Console.WriteLine("Вывод числа с учетом сотых");
System.Console.WriteLine(a); */
//----------------------------------------------------

//S1.2. Вывести на экран число e (основание натурального логарифма) с точностью до десятых.
//----------------------------------------------------
/* Console.Clear();
double e = 2.7;
System.Console.WriteLine("Вывести на экран число 'e' (основание натурального логарифма) с точностью до 10-ых");
System.Console.WriteLine(e); */
//----------------------------------------------------

//S1.3. Составить программу вывода на экран числа, вводимого с клавиатуры. 
//Выводимому числу должно предшествовать сообщение «Вы ввели число».
//----------------------------------------------------
Console.Clear();
System.Console.WriteLine("Введите число");
string? num = Console.ReadLine();
System.Console.WriteLine("Вы ввели число");
Console.Write(num); 
//----------------------------------------------------